(package! org-super-agenda)
(package! org-modern)
(package! org-gcal)

(package! calibredb)

(package! openwith)

(package! kconfig-mode)
(package! dts-mode)
(package! bitbake)

(package! kbd-mode
  :recipe (:host 'local-repo :local-repo "~/Projects/kbd-mode" ))

(package! systemd-mode)

(package! code-cells)
