(package! org-super-agenda)
(package! org-modern)
(package! org-gcal)

(package! calibredb)

(package! openwith)

(package! kconfig-mode)
(package! dts-mode)
(package! bitbake)

(package! kbd-mode
  :recipe (:host github :repo "reinaldoossuna/kbd-mode" ))

(package! systemd-mode)

(package! code-cells)
(package! docstr)

;; (package! lsp-tailwindcss :recipe (:host github :repo "merrickluo/lsp-tailwindcss"))
(package! justl :recipe (:host github :repo "psibi/justl.el"))
(package! just-mode :recipe (:host github :repo "leon-barrett/just-mode.el"))
